function dX = Dynamic_R3BJ2(t,X,u)

% global G J2 Re
G  = 6.67430e-11;
J2 = 1.08262668e-3;
Re = 6378137;
M(1)=3.986004415*10^14./G;
M(2) = 4.902818954*10^12./G;
%位置与速度赋值
Rm = X(7:9);
Vm = X(10:12);
% Rm = [26471349.2301343;349598000.087975;-96455804.5321573];
% Vm = [-1020.03107792330;165.649225417355;320.447682569759];
R = X(1:3);
V = X(4:6);
% R = X(1:3);
% V = X(4:6);

%相对位置与距离
Rmc = R - Rm;
rm = norm(Rm);
r  = norm(R);
rmc = norm(Rmc);

%动力学方程
am = -G*(M(1)+M(2))*Rm/rm^3;
a  = -G*M(1)*R/r^3 - G*M(2)*Rmc/rmc^3 - G*M(2)*Rm/rm^3;

%添加J2摄动项
aJ2 = -G*M(1)/r^3*[ R(1)*(3*J2*(Re/r)^2)/2*(1-5*(R(3)/r)^2); R(2)*(3*J2*(Re/r)^2)/2*(1-5*(R(3)/r)^2); R(3)*(3*J2*(Re/r)^2)/2*(3-5*(R(3)/r)^2)];

%运动学微分方程
dX = [ V; a+aJ2 ;Vm; am ];
    
end